app/views/shelters/index.html.erb

    <h3> <%= link_to shelter.name, "/shelters/#{shelter.id}" %></h3>
    <h5> Pets available: <%= shelter.pets.count %></h5>
---
SELECT COUNT(*) FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 16]]