app/controllers/favorites_controller.rb

  def index
    ids = cookies[:favorites].split(',').uniq
    @favorited_pets = Pet.find(ids)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]