app/controllers/petapplications_controller.rb

  def new
    ids = session[:favorites]
    @favorited_pets = Pet.find(ids).map {|pet| [pet.id, pet.name]}
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 575], ["LIMIT", 1]]