app/controllers/pets_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pets" ("shelter_id", "image", "name", "description", "approx_age", "sex", "adoptable?") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["shelter_id", 2], ["image", "pebbles.png"], ["name", "Pebbles"], ["description", "Half breed lab"], ["approx_age", "3"], ["sex", "Female"], ["adoptable?", "t"]]
---
  def create
    shelter = Shelter.find(params[:id])
    pet = shelter.pets.create(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "pets" SET "description" = $1, "approx_age" = $2 WHERE "pets"."id" = $3  [["description", "Half breed golden retriever"], ["approx_age", "4"], ["id", 4]]
---
  def update
    pet = Pet.find(params[:id])
    pet.update(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]
---
  def destroy
    pet = Pet.find(params[:id])
    if pet.adopter_id
      flash[:sad] = 'Pets with approved applications cannot be deleted.'
      redirect_back fallback_location: '/pets/'
    else
      Pet.destroy(params[:id])