app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "image", "created_at", "updated_at", "shelter_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @shelter = Shelter.find(params[:id])
    @new_review = @shelter.reviews.create(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "content" = $2, "rating" = $3, "image" = $4, "updated_at" = $5 WHERE "reviews"."id" = $6
---
  def update
    review = Review.find(params[:id])
    review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    review = Review.find(params[:id])
    review.destroy