app/controllers/shelters_controller.rb

  def pets
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]