app/controllers/shelters_controller.rb

  def index
    @shelters = Shelter.all
---
SELECT "shelters".* FROM "shelters"

  def create
    @shelter = Shelter.new(shelter_params)
    if @shelter.save
---
INSERT INTO "shelters" ("name", "address", "city", "state", "zip") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New Shelter"], ["address", "123 Main"], ["city", "Denver"], ["state", "CO"], ["zip", "80211"]]

  def show
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def edit
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    shelter = Shelter.find(params[:id])
    shelter.update(shelter_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1 WHERE "shelters"."id" = $2  [["name", "Shelter of Cat"], ["id", 8]]

  def destroy
    if shelter.approved_pets?
      flash[:sad] = 'Shelter with approved applications cannot be deleted.'
      redirect_back fallback_location: '/shelters/'
    else
      shelter.pets.each {|pet| pet.remove_favorite(@favorites)}
      Shelter.destroy(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 7]]
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 7]]