app/controllers/shelterpets_controller.rb

  def index
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]